import logo from './logo.svg';
import './App.css';


const SomeSecrets = () => {
 return (
     <div>
         <div className="faq_reserve__some-secrets">
             <div className="faq_reserve__some_serets__header">Некоторые секреты</div>
             <div className="faq_reserve__some_serets__first-item">
                 <div className="faq_reserve__some_serets__first-item__pic">
                     <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                         <path
                             d="M12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22Z"
                             fill="#218A38" fill-opacity="0.12"/>
                         <path
                             d="M10.3228 16.2849C10.1104 16.2844 9.90578 16.205 9.7486 16.0621L6.32041 12.9425C6.22933 12.8693 6.15416 12.7783 6.09952 12.6751C6.04488 12.5718 6.01193 12.4585 6.00269 12.342C5.99344 12.2256 6.00811 12.1085 6.04577 11.9979C6.08344 11.8873 6.14331 11.7856 6.22172 11.699C6.30013 11.6124 6.39541 11.5427 6.50171 11.4943C6.60802 11.4459 6.72311 11.4197 6.8399 11.4173C6.9567 11.415 7.07274 11.4366 7.1809 11.4807C7.28906 11.5248 7.38705 11.5906 7.46886 11.674L10.2971 14.2452L16.5707 7.96301C16.7321 7.80163 16.951 7.71096 17.1792 7.71096C17.2922 7.71096 17.4041 7.73322 17.5085 7.77647C17.6129 7.81971 17.7078 7.8831 17.7877 7.96301C17.8676 8.04292 17.931 8.13779 17.9743 8.2422C18.0175 8.3466 18.0398 8.45851 18.0398 8.57151C18.0398 8.68452 18.0175 8.79643 17.9743 8.90083C17.931 9.00524 17.8676 9.10011 17.7877 9.18002L10.9313 16.0364C10.8512 16.1158 10.7563 16.1787 10.6519 16.2213C10.5474 16.264 10.4356 16.2856 10.3228 16.2849Z"
                             fill="#218A38"/>
                     </svg>
                 </div>
                 <div className="faq_reserve__some_serets__first-item__text">При увольнении на фактически выплаченные
                     дни компенсации остатки корректируются и в итоге резерв при увольнении равен нулю.
                 </div>
             </div>
             <div className="faq_reserve__some-secrets__second-item">
                 <div className="faq_reserve__some_secrets__second-item__pic">
                     <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                         <path
                             d="M12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22Z"
                             fill="#218A38" fill-opacity="0.12"/>
                         <path
                             d="M10.3228 16.2849C10.1104 16.2844 9.90578 16.205 9.7486 16.0621L6.32041 12.9425C6.22933 12.8693 6.15416 12.7783 6.09952 12.6751C6.04488 12.5718 6.01193 12.4585 6.00269 12.342C5.99344 12.2256 6.00811 12.1085 6.04577 11.9979C6.08344 11.8873 6.14331 11.7856 6.22172 11.699C6.30013 11.6124 6.39541 11.5427 6.50171 11.4943C6.60802 11.4459 6.72311 11.4197 6.8399 11.4173C6.9567 11.415 7.07274 11.4366 7.1809 11.4807C7.28906 11.5248 7.38705 11.5906 7.46886 11.674L10.2971 14.2452L16.5707 7.96301C16.7321 7.80163 16.951 7.71096 17.1792 7.71096C17.2922 7.71096 17.4041 7.73322 17.5085 7.77647C17.6129 7.81971 17.7078 7.8831 17.7877 7.96301C17.8676 8.04292 17.931 8.13779 17.9743 8.2422C18.0175 8.3466 18.0398 8.45851 18.0398 8.57151C18.0398 8.68452 18.0175 8.79643 17.9743 8.90083C17.931 9.00524 17.8676 9.10011 17.7877 9.18002L10.9313 16.0364C10.8512 16.1158 10.7563 16.1787 10.6519 16.2213C10.5474 16.264 10.4356 16.2856 10.3228 16.2849Z"
                             fill="#218A38"/>
                     </svg>
                 </div>
                 <div className="faq_reserve__some_secrets__second-item__text">Если у сотрудника имеются отрицательные
                     дни отпуска (т.е. фактические отпуска были предоставлены авансом), резерв не начисляется до тех
                     пор, пока количество дней отпуска не станет положительным.
                 </div>
             </div>
             <div className="faq_reserve__some-secrets__third-item">
                 <div className="faq_reserve__some_secrets__third-item__pic">
                     <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                         <path
                             d="M12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22Z"
                             fill="#218A38" fill-opacity="0.12"/>
                         <path
                             d="M10.3228 16.2849C10.1104 16.2844 9.90578 16.205 9.7486 16.0621L6.32041 12.9425C6.22933 12.8693 6.15416 12.7783 6.09952 12.6751C6.04488 12.5718 6.01193 12.4585 6.00269 12.342C5.99344 12.2256 6.00811 12.1085 6.04577 11.9979C6.08344 11.8873 6.14331 11.7856 6.22172 11.699C6.30013 11.6124 6.39541 11.5427 6.50171 11.4943C6.60802 11.4459 6.72311 11.4197 6.8399 11.4173C6.9567 11.415 7.07274 11.4366 7.1809 11.4807C7.28906 11.5248 7.38705 11.5906 7.46886 11.674L10.2971 14.2452L16.5707 7.96301C16.7321 7.80163 16.951 7.71096 17.1792 7.71096C17.2922 7.71096 17.4041 7.73322 17.5085 7.77647C17.6129 7.81971 17.7078 7.8831 17.7877 7.96301C17.8676 8.04292 17.931 8.13779 17.9743 8.2422C18.0175 8.3466 18.0398 8.45851 18.0398 8.57151C18.0398 8.68452 18.0175 8.79643 17.9743 8.90083C17.931 9.00524 17.8676 9.10011 17.7877 9.18002L10.9313 16.0364C10.8512 16.1158 10.7563 16.1787 10.6519 16.2213C10.5474 16.264 10.4356 16.2856 10.3228 16.2849Z"
                             fill="#218A38"/>
                     </svg>
                 </div>
                 <div className="faq_reserve__some_secrets__third-item__text"> Если у сотрудников производится
                     перерасчет зарплаты за прошлые периоды, соответственно производится и перерасчет резерва за те же
                     периоды в соответствии с уточненным заработком.
                 </div>
             </div>
             <div className="faq_reserve__some-secrets__fourth-item">
                 <div className="faq_reserve__some_secrets__fourth-item__pic">
                     <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                         <path
                             d="M12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22Z"
                             fill="#218A38" fill-opacity="0.12"/>
                         <path
                             d="M10.3228 16.2849C10.1104 16.2844 9.90578 16.205 9.7486 16.0621L6.32041 12.9425C6.22933 12.8693 6.15416 12.7783 6.09952 12.6751C6.04488 12.5718 6.01193 12.4585 6.00269 12.342C5.99344 12.2256 6.00811 12.1085 6.04577 11.9979C6.08344 11.8873 6.14331 11.7856 6.22172 11.699C6.30013 11.6124 6.39541 11.5427 6.50171 11.4943C6.60802 11.4459 6.72311 11.4197 6.8399 11.4173C6.9567 11.415 7.07274 11.4366 7.1809 11.4807C7.28906 11.5248 7.38705 11.5906 7.46886 11.674L10.2971 14.2452L16.5707 7.96301C16.7321 7.80163 16.951 7.71096 17.1792 7.71096C17.2922 7.71096 17.4041 7.73322 17.5085 7.77647C17.6129 7.81971 17.7078 7.8831 17.7877 7.96301C17.8676 8.04292 17.931 8.13779 17.9743 8.2422C18.0175 8.3466 18.0398 8.45851 18.0398 8.57151C18.0398 8.68452 18.0175 8.79643 17.9743 8.90083C17.931 9.00524 17.8676 9.10011 17.7877 9.18002L10.9313 16.0364C10.8512 16.1158 10.7563 16.1787 10.6519 16.2213C10.5474 16.264 10.4356 16.2856 10.3228 16.2849Z"
                             fill="#218A38"/>
                     </svg>
                 </div>
                 <div className="faq_reserve__some_secrets__fourth-item__text">Резерв на отпуск в PL — это дельта,
                     поэтому в случае если на конец текущего месяца накопленный резерв меньше резерва на конец
                     предыдущего месяца, то в PL будет положительный эффект, увеличивающий прибыль, и наоборот.
                 </div>
             </div>
             <div className="faq_reserve__some-secrets__fifth-item">
                 <div className="faq_reserve__some_secrets__fifth-item__pic">
                     <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                         <path
                             d="M12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22Z"
                             fill="#218A38" fill-opacity="0.12"/>
                         <path
                             d="M10.3228 16.2849C10.1104 16.2844 9.90578 16.205 9.7486 16.0621L6.32041 12.9425C6.22933 12.8693 6.15416 12.7783 6.09952 12.6751C6.04488 12.5718 6.01193 12.4585 6.00269 12.342C5.99344 12.2256 6.00811 12.1085 6.04577 11.9979C6.08344 11.8873 6.14331 11.7856 6.22172 11.699C6.30013 11.6124 6.39541 11.5427 6.50171 11.4943C6.60802 11.4459 6.72311 11.4197 6.8399 11.4173C6.9567 11.415 7.07274 11.4366 7.1809 11.4807C7.28906 11.5248 7.38705 11.5906 7.46886 11.674L10.2971 14.2452L16.5707 7.96301C16.7321 7.80163 16.951 7.71096 17.1792 7.71096C17.2922 7.71096 17.4041 7.73322 17.5085 7.77647C17.6129 7.81971 17.7078 7.8831 17.7877 7.96301C17.8676 8.04292 17.931 8.13779 17.9743 8.2422C18.0175 8.3466 18.0398 8.45851 18.0398 8.57151C18.0398 8.68452 18.0175 8.79643 17.9743 8.90083C17.931 9.00524 17.8676 9.10011 17.7877 9.18002L10.9313 16.0364C10.8512 16.1158 10.7563 16.1787 10.6519 16.2213C10.5474 16.264 10.4356 16.2856 10.3228 16.2849Z"
                             fill="#218A38"/>
                     </svg>
                 </div>
                 <div className="faq_reserve__some_secrets__fifth-item__text"> В P&L 2 статьи непосредственно связанны
                     друг с другом: Отпуск и больничный и Резерв на отпуск. Факт по выплате отпускных сотруднику
                     проходит по статье «Отпуск и больничный», при этом по статье «Резерв на отпуск» сторнируется резерв
                     в пересчете на дни отпуска.
                 </div>
             </div>

             <div className="faq_reserve__some-secrets__sixth-item">
                 <div className="faq_reserve__some_secrets__sixth-item__pic">
                     <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                         <path
                             d="M12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22Z"
                             fill="#218A38" fill-opacity="0.12"/>
                         <path
                             d="M10.3228 16.2849C10.1104 16.2844 9.90578 16.205 9.7486 16.0621L6.32041 12.9425C6.22933 12.8693 6.15416 12.7783 6.09952 12.6751C6.04488 12.5718 6.01193 12.4585 6.00269 12.342C5.99344 12.2256 6.00811 12.1085 6.04577 11.9979C6.08344 11.8873 6.14331 11.7856 6.22172 11.699C6.30013 11.6124 6.39541 11.5427 6.50171 11.4943C6.60802 11.4459 6.72311 11.4197 6.8399 11.4173C6.9567 11.415 7.07274 11.4366 7.1809 11.4807C7.28906 11.5248 7.38705 11.5906 7.46886 11.674L10.2971 14.2452L16.5707 7.96301C16.7321 7.80163 16.951 7.71096 17.1792 7.71096C17.2922 7.71096 17.4041 7.73322 17.5085 7.77647C17.6129 7.81971 17.7078 7.8831 17.7877 7.96301C17.8676 8.04292 17.931 8.13779 17.9743 8.2422C18.0175 8.3466 18.0398 8.45851 18.0398 8.57151C18.0398 8.68452 18.0175 8.79643 17.9743 8.90083C17.931 9.00524 17.8676 9.10011 17.7877 9.18002L10.9313 16.0364C10.8512 16.1158 10.7563 16.1787 10.6519 16.2213C10.5474 16.264 10.4356 16.2856 10.3228 16.2849Z"
                             fill="#218A38"/>
                     </svg>
                 </div>
                 <div className="faq_reserve__some_secrets__sixth-item__text"> Если же сотрудник в отпуск идет, то
                     затраты на выплату ему отпускных компенсируются накопленным резервом. Если сотрудник не идет в
                     отпуск , резерв на отпуск продолжает начисляться по этой схеме пока сотрудник работает.
                 </div>
             </div>
         </div>
     </div>



  )
}

export default SomeSecrets;
